bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/component/can.h
#define CAN_ILS_RF0NL_Pos                     _U_(0)                                               /**< (CAN_ILS) Rx FIFO 0 New Message Interrupt Line Position */
#define CAN_ILS_RF0NL_Msk                     (_U_(0x1) << CAN_ILS_RF0NL_Pos)                      /**< (CAN_ILS) Rx FIFO 0 New Message Interrupt Line Mask */
#define CAN_ILS_RF0NL(value)                  (CAN_ILS_RF0NL_Msk & ((value) << CAN_ILS_RF0NL_Pos))
#define CAN_ILS_RF0WL_Pos                     _U_(1)                                               /**< (CAN_ILS) Rx FIFO 0 Watermark Reached Interrupt Line Position */
#define CAN_ILS_RF0WL_Msk                     (_U_(0x1) << CAN_ILS_RF0WL_Pos)                      /**< (CAN_ILS) Rx FIFO 0 Watermark Reached Interrupt Line Mask */
#define CAN_ILS_RF0WL(value)                  (CAN_ILS_RF0WL_Msk & ((value) << CAN_ILS_RF0WL_Pos))
#define CAN_ILS_RF0FL_Pos                     _U_(2)                                               /**< (CAN_ILS) Rx FIFO 0 Full Interrupt Line Position */
#define CAN_ILS_RF0FL_Msk                     (_U_(0x1) << CAN_ILS_RF0FL_Pos)                      /**< (CAN_ILS) Rx FIFO 0 Full Interrupt Line Mask */
#define CAN_ILS_RF0FL(value)                  (CAN_ILS_RF0FL_Msk & ((value) << CAN_ILS_RF0FL_Pos))
#define CAN_ILS_RF0LL_Pos                     _U_(3)                                               /**< (CAN_ILS) Rx FIFO 0 Message Lost Interrupt Line Position */
#define CAN_ILS_RF0LL_Msk                     (_U_(0x1) << CAN_ILS_RF0LL_Pos)                      /**< (CAN_ILS) Rx FIFO 0 Message Lost Interrupt Line Mask */
#define CAN_ILS_RF0LL(value)                  (CAN_ILS_RF0LL_Msk & ((value) << CAN_ILS_RF0LL_Pos))
#define CAN_ILS_RF1NL_Pos                     _U_(4)                                               /**< (CAN_ILS) Rx FIFO 1 New Message Interrupt Line Position */
#define CAN_ILS_RF1NL_Msk                     (_U_(0x1) << CAN_ILS_RF1NL_Pos)                      /**< (CAN_ILS) Rx FIFO 1 New Message Interrupt Line Mask */
#define CAN_ILS_RF1NL(value)                  (CAN_ILS_RF1NL_Msk & ((value) << CAN_ILS_RF1NL_Pos))
#define CAN_ILS_RF1WL_Pos                     _U_(5)                                               /**< (CAN_ILS) Rx FIFO 1 Watermark Reached Interrupt Line Position */
#define CAN_ILS_RF1WL_Msk                     (_U_(0x1) << CAN_ILS_RF1WL_Pos)                      /**< (CAN_ILS) Rx FIFO 1 Watermark Reached Interrupt Line Mask */
#define CAN_ILS_RF1WL(value)                  (CAN_ILS_RF1WL_Msk & ((value) << CAN_ILS_RF1WL_Pos))
#define CAN_ILS_RF1FL_Pos                     _U_(6)                                               /**< (CAN_ILS) Rx FIFO 1 FIFO Full Interrupt Line Position */
#define CAN_ILS_RF1FL_Msk                     (_U_(0x1) << CAN_ILS_RF1FL_Pos)                      /**< (CAN_ILS) Rx FIFO 1 FIFO Full Interrupt Line Mask */
#define CAN_ILS_RF1FL(value)                  (CAN_ILS_RF1FL_Msk & ((value) << CAN_ILS_RF1FL_Pos))
#define CAN_ILS_RF1LL_Pos                     _U_(7)                                               /**< (CAN_ILS) Rx FIFO 1 Message Lost Interrupt Line Position */
#define CAN_ILS_RF1LL_Msk                     (_U_(0x1) << CAN_ILS_RF1LL_Pos)                      /**< (CAN_ILS) Rx FIFO 1 Message Lost Interrupt Line Mask */
#define CAN_ILS_RF1LL(value)                  (CAN_ILS_RF1LL_Msk & ((value) << CAN_ILS_RF1LL_Pos))
#define CAN_ILS_HPML_Pos                      _U_(8)                                               /**< (CAN_ILS) High Priority Message Interrupt Line Position */
#define CAN_ILS_HPML_Msk                      (_U_(0x1) << CAN_ILS_HPML_Pos)                       /**< (CAN_ILS) High Priority Message Interrupt Line Mask */
#define CAN_ILS_HPML(value)                   (CAN_ILS_HPML_Msk & ((value) << CAN_ILS_HPML_Pos))  
#define CAN_ILS_TCL_Pos                       _U_(9)                                               /**< (CAN_ILS) Timestamp Completed Interrupt Line Position */
#define CAN_ILS_TCL_Msk                       (_U_(0x1) << CAN_ILS_TCL_Pos)                        /**< (CAN_ILS) Timestamp Completed Interrupt Line Mask */
#define CAN_ILS_TCL(value)                    (CAN_ILS_TCL_Msk & ((value) << CAN_ILS_TCL_Pos))    
#define CAN_ILS_TCFL_Pos                      _U_(10)                                              /**< (CAN_ILS) Transmission Cancellation Finished Interrupt Line Position */
#define CAN_ILS_TCFL_Msk                      (_U_(0x1) << CAN_ILS_TCFL_Pos)                       /**< (CAN_ILS) Transmission Cancellation Finished Interrupt Line Mask */
#define CAN_ILS_TCFL(value)                   (CAN_ILS_TCFL_Msk & ((value) << CAN_ILS_TCFL_Pos))  
#define CAN_ILS_TFEL_Pos                      _U_(11)                                              /**< (CAN_ILS) Tx FIFO Empty Interrupt Line Position */
#define CAN_ILS_TFEL_Msk                      (_U_(0x1) << CAN_ILS_TFEL_Pos)                       /**< (CAN_ILS) Tx FIFO Empty Interrupt Line Mask */
#define CAN_ILS_TFEL(value)                   (CAN_ILS_TFEL_Msk & ((value) << CAN_ILS_TFEL_Pos))  
#define CAN_ILS_TEFNL_Pos                     _U_(12)                                              /**< (CAN_ILS) Tx Event FIFO New Entry Interrupt Line Position */
#define CAN_ILS_TEFNL_Msk                     (_U_(0x1) << CAN_ILS_TEFNL_Pos)                      /**< (CAN_ILS) Tx Event FIFO New Entry Interrupt Line Mask */
#define CAN_ILS_TEFNL(value)                  (CAN_ILS_TEFNL_Msk & ((value) << CAN_ILS_TEFNL_Pos))
#define CAN_ILS_TEFWL_Pos                     _U_(13)                                              /**< (CAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Position */
#define CAN_ILS_TEFWL_Msk                     (_U_(0x1) << CAN_ILS_TEFWL_Pos)                      /**< (CAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Mask */
#define CAN_ILS_TEFWL(value)                  (CAN_ILS_TEFWL_Msk & ((value) << CAN_ILS_TEFWL_Pos))
#define CAN_ILS_TEFFL_Pos                     _U_(14)                                              /**< (CAN_ILS) Tx Event FIFO Full Interrupt Line Position */
#define CAN_ILS_TEFFL_Msk                     (_U_(0x1) << CAN_ILS_TEFFL_Pos)                      /**< (CAN_ILS) Tx Event FIFO Full Interrupt Line Mask */
#define CAN_ILS_TEFFL(value)                  (CAN_ILS_TEFFL_Msk & ((value) << CAN_ILS_TEFFL_Pos))
#define CAN_ILS_TEFLL_Pos                     _U_(15)                                              /**< (CAN_ILS) Tx Event FIFO Element Lost Interrupt Line Position */
#define CAN_ILS_TEFLL_Msk                     (_U_(0x1) << CAN_ILS_TEFLL_Pos)                      /**< (CAN_ILS) Tx Event FIFO Element Lost Interrupt Line Mask */
#define CAN_ILS_TEFLL(value)                  (CAN_ILS_TEFLL_Msk & ((value) << CAN_ILS_TEFLL_Pos))
#define CAN_ILS_TSWL_Pos                      _U_(16)                                              /**< (CAN_ILS) Timestamp Wraparound Interrupt Line Position */
#define CAN_ILS_TSWL_Msk                      (_U_(0x1) << CAN_ILS_TSWL_Pos)                       /**< (CAN_ILS) Timestamp Wraparound Interrupt Line Mask */
#define CAN_ILS_TSWL(value)                   (CAN_ILS_TSWL_Msk & ((value) << CAN_ILS_TSWL_Pos))  
#define CAN_ILS_MRAFL_Pos                     _U_(17)                                              /**< (CAN_ILS) Message RAM Access Failure Interrupt Line Position */
#define CAN_ILS_MRAFL_Msk                     (_U_(0x1) << CAN_ILS_MRAFL_Pos)                      /**< (CAN_ILS) Message RAM Access Failure Interrupt Line Mask */
#define CAN_ILS_MRAFL(value)                  (CAN_ILS_MRAFL_Msk & ((value) << CAN_ILS_MRAFL_Pos))
#define CAN_ILS_TOOL_Pos                      _U_(18)                                              /**< (CAN_ILS) Timeout Occurred Interrupt Line Position */
#define CAN_ILS_TOOL_Msk                      (_U_(0x1) << CAN_ILS_TOOL_Pos)                       /**< (CAN_ILS) Timeout Occurred Interrupt Line Mask */
#define CAN_ILS_TOOL(value)                   (CAN_ILS_TOOL_Msk & ((value) << CAN_ILS_TOOL_Pos))  
#define CAN_ILS_DRXL_Pos                      _U_(19)                                              /**< (CAN_ILS) Message stored to Dedicated Rx Buffer Interrupt Line Position */
#define CAN_ILS_DRXL_Msk                      (_U_(0x1) << CAN_ILS_DRXL_Pos)                       /**< (CAN_ILS) Message stored to Dedicated Rx Buffer Interrupt Line Mask */
#define CAN_ILS_DRXL(value)                   (CAN_ILS_DRXL_Msk & ((value) << CAN_ILS_DRXL_Pos))  
#define CAN_ILS_BECL_Pos                      _U_(20)                                              /**< (CAN_ILS) Bit Error Corrected Interrupt Line Position */
#define CAN_ILS_BECL_Msk                      (_U_(0x1) << CAN_ILS_BECL_Pos)                       /**< (CAN_ILS) Bit Error Corrected Interrupt Line Mask */
#define CAN_ILS_BECL(value)                   (CAN_ILS_BECL_Msk & ((value) << CAN_ILS_BECL_Pos))  
#define CAN_ILS_BEUL_Pos                      _U_(21)                                              /**< (CAN_ILS) Bit Error Uncorrected Interrupt Line Position */
#define CAN_ILS_BEUL_Msk                      (_U_(0x1) << CAN_ILS_BEUL_Pos)                       /**< (CAN_ILS) Bit Error Uncorrected Interrupt Line Mask */
#define CAN_ILS_BEUL(value)                   (CAN_ILS_BEUL_Msk & ((value) << CAN_ILS_BEUL_Pos))  
#define CAN_ILS_ELOL_Pos                      _U_(22)                                              /**< (CAN_ILS) Error Logging Overflow Interrupt Line Position */
#define CAN_ILS_ELOL_Msk                      (_U_(0x1) << CAN_ILS_ELOL_Pos)                       /**< (CAN_ILS) Error Logging Overflow Interrupt Line Mask */
#define CAN_ILS_ELOL(value)                   (CAN_ILS_ELOL_Msk & ((value) << CAN_ILS_ELOL_Pos))  
#define CAN_ILS_EPL_Pos                       _U_(23)                                              /**< (CAN_ILS) Error Passive Interrupt Line Position */
#define CAN_ILS_EPL_Msk                       (_U_(0x1) << CAN_ILS_EPL_Pos)                        /**< (CAN_ILS) Error Passive Interrupt Line Mask */
#define CAN_ILS_EPL(value)                    (CAN_ILS_EPL_Msk & ((value) << CAN_ILS_EPL_Pos))    
#define CAN_ILS_EWL_Pos                       _U_(24)                                              /**< (CAN_ILS) Warning Status Interrupt Line Position */
#define CAN_ILS_EWL_Msk                       (_U_(0x1) << CAN_ILS_EWL_Pos)                        /**< (CAN_ILS) Warning Status Interrupt Line Mask */
#define CAN_ILS_EWL(value)                    (CAN_ILS_EWL_Msk & ((value) << CAN_ILS_EWL_Pos))    
#define CAN_ILS_BOL_Pos                       _U_(25)                                              /**< (CAN_ILS) Bus_Off Status Interrupt Line Position */
#define CAN_ILS_BOL_Msk                       (_U_(0x1) << CAN_ILS_BOL_Pos)                        /**< (CAN_ILS) Bus_Off Status Interrupt Line Mask */
#define CAN_ILS_BOL(value)                    (CAN_ILS_BOL_Msk & ((value) << CAN_ILS_BOL_Pos))    
#define CAN_ILS_WDIL_Pos                      _U_(26)                                              /**< (CAN_ILS) Watchdog Interrupt Interrupt Line Position */
#define CAN_ILS_WDIL_Msk                      (_U_(0x1) << CAN_ILS_WDIL_Pos)                       /**< (CAN_ILS) Watchdog Interrupt Interrupt Line Mask */
#define CAN_ILS_WDIL(value)                   (CAN_ILS_WDIL_Msk & ((value) << CAN_ILS_WDIL_Pos))  
#define CAN_ILS_PEAL_Pos                      _U_(27)                                              /**< (CAN_ILS) Protocol Error in Arbitration Phase Line Position */
#define CAN_ILS_PEAL_Msk                      (_U_(0x1) << CAN_ILS_PEAL_Pos)                       /**< (CAN_ILS) Protocol Error in Arbitration Phase Line Mask */
#define CAN_ILS_PEAL(value)                   (CAN_ILS_PEAL_Msk & ((value) << CAN_ILS_PEAL_Pos))  
#define CAN_ILS_PEDL_Pos                      _U_(28)                                              /**< (CAN_ILS) Protocol Error in Data Phase Line Position */
#define CAN_ILS_PEDL_Msk                      (_U_(0x1) << CAN_ILS_PEDL_Pos)                       /**< (CAN_ILS) Protocol Error in Data Phase Line Mask */
#define CAN_ILS_PEDL(value)                   (CAN_ILS_PEDL_Msk & ((value) << CAN_ILS_PEDL_Pos))  
#define CAN_ILS_ARAL_Pos                      _U_(29)                                              /**< (CAN_ILS) Access to Reserved Address Line Position */
#define CAN_ILS_ARAL_Msk                      (_U_(0x1) << CAN_ILS_ARAL_Pos)                       /**< (CAN_ILS) Access to Reserved Address Line Mask */
#define CAN_ILS_ARAL(value)                   (CAN_ILS_ARAL_Msk & ((value) << CAN_ILS_ARAL_Pos))  
#define CAN_ILS_Msk                           _U_(0x3FFFFFFF)                                      /**< (CAN_ILS) Register Mask  */


