bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/component/can.h
#define CAN_XIDAM_EIDM_Pos                    _U_(0)                                               /**< (CAN_XIDAM) Extended ID Mask Position */
#define CAN_XIDAM_EIDM_Msk                    (_U_(0x1FFFFFFF) << CAN_XIDAM_EIDM_Pos)              /**< (CAN_XIDAM) Extended ID Mask Mask */
#define CAN_XIDAM_EIDM(value)                 (CAN_XIDAM_EIDM_Msk & ((value) << CAN_XIDAM_EIDM_Pos))
#define CAN_XIDAM_Msk                         _U_(0x1FFFFFFF)                                      /**< (CAN_XIDAM) Register Mask  */


/* -------- CAN_HPMS : (CAN Offset: 0x94) ( R/ 32) High Priority Message Status -------- */
#define CAN_HPMS_RESETVALUE                   _U_(0x00)                                            /**<  (CAN_HPMS) High Priority Message Status  Reset Value */

#define CAN_HPMS_BIDX_Pos                     _U_(0)                                               /**< (CAN_HPMS) Buffer Index Position */
#define CAN_HPMS_BIDX_Msk                     (_U_(0x3F) << CAN_HPMS_BIDX_Pos)                     /**< (CAN_HPMS) Buffer Index Mask */
#define CAN_HPMS_BIDX(value)                  (CAN_HPMS_BIDX_Msk & ((value) << CAN_HPMS_BIDX_Pos))
#define CAN_HPMS_MSI_Pos                      _U_(6)                                               /**< (CAN_HPMS) Message Storage Indicator Position */
#define CAN_HPMS_MSI_Msk                      (_U_(0x3) << CAN_HPMS_MSI_Pos)                       /**< (CAN_HPMS) Message Storage Indicator Mask */
#define CAN_HPMS_MSI(value)                   (CAN_HPMS_MSI_Msk & ((value) << CAN_HPMS_MSI_Pos))  
#define   CAN_HPMS_MSI_NONE_Val               _U_(0x0)                                             /**< (CAN_HPMS) No FIFO selected  */
#define   CAN_HPMS_MSI_LOST_Val               _U_(0x1)                                             /**< (CAN_HPMS) FIFO message lost  */
#define   CAN_HPMS_MSI_FIFO0_Val              _U_(0x2)                                             /**< (CAN_HPMS) Message stored in FIFO 0  */
#define   CAN_HPMS_MSI_FIFO1_Val              _U_(0x3)                                             /**< (CAN_HPMS) Message stored in FIFO 1  */
#define CAN_HPMS_MSI_NONE                     (CAN_HPMS_MSI_NONE_Val << CAN_HPMS_MSI_Pos)          /**< (CAN_HPMS) No FIFO selected Position  */
#define CAN_HPMS_MSI_LOST                     (CAN_HPMS_MSI_LOST_Val << CAN_HPMS_MSI_Pos)          /**< (CAN_HPMS) FIFO message lost Position  */
#define CAN_HPMS_MSI_FIFO0                    (CAN_HPMS_MSI_FIFO0_Val << CAN_HPMS_MSI_Pos)         /**< (CAN_HPMS) Message stored in FIFO 0 Position  */
#define CAN_HPMS_MSI_FIFO1                    (CAN_HPMS_MSI_FIFO1_Val << CAN_HPMS_MSI_Pos)         /**< (CAN_HPMS) Message stored in FIFO 1 Position  */
#define CAN_HPMS_FIDX_Pos                     _U_(8)                                               /**< (CAN_HPMS) Filter Index Position */
#define CAN_HPMS_FIDX_Msk                     (_U_(0x7F) << CAN_HPMS_FIDX_Pos)                     /**< (CAN_HPMS) Filter Index Mask */
#define CAN_HPMS_FIDX(value)                  (CAN_HPMS_FIDX_Msk & ((value) << CAN_HPMS_FIDX_Pos))
#define CAN_HPMS_FLST_Pos                     _U_(15)                                              /**< (CAN_HPMS) Filter List Position */
#define CAN_HPMS_FLST_Msk                     (_U_(0x1) << CAN_HPMS_FLST_Pos)                      /**< (CAN_HPMS) Filter List Mask */
#define CAN_HPMS_FLST(value)                  (CAN_HPMS_FLST_Msk & ((value) << CAN_HPMS_FLST_Pos))
#define CAN_HPMS_Msk                          _U_(0x0000FFFF)                                      /**< (CAN_HPMS) Register Mask  */


/* -------- CAN_NDAT1 : (CAN Offset: 0x98) (R/W 32) New Data 1 -------- */
#define CAN_NDAT1_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_NDAT1) New Data 1  Reset Value */

#define CAN_NDAT1_ND0_Pos                     _U_(0)                                               /**< (CAN_NDAT1) New Data 0 Position */
#define CAN_NDAT1_ND0_Msk                     (_U_(0x1) << CAN_NDAT1_ND0_Pos)                      /**< (CAN_NDAT1) New Data 0 Mask */
#define CAN_NDAT1_ND0(value)                  (CAN_NDAT1_ND0_Msk & ((value) << CAN_NDAT1_ND0_Pos))
#define CAN_NDAT1_ND1_Pos                     _U_(1)                                               /**< (CAN_NDAT1) New Data 1 Position */
#define CAN_NDAT1_ND1_Msk                     (_U_(0x1) << CAN_NDAT1_ND1_Pos)                      /**< (CAN_NDAT1) New Data 1 Mask */
#define CAN_NDAT1_ND1(value)                  (CAN_NDAT1_ND1_Msk & ((value) << CAN_NDAT1_ND1_Pos))
#define CAN_NDAT1_ND2_Pos                     _U_(2)                                               /**< (CAN_NDAT1) New Data 2 Position */
#define CAN_NDAT1_ND2_Msk                     (_U_(0x1) << CAN_NDAT1_ND2_Pos)                      /**< (CAN_NDAT1) New Data 2 Mask */
#define CAN_NDAT1_ND2(value)                  (CAN_NDAT1_ND2_Msk & ((value) << CAN_NDAT1_ND2_Pos))
#define CAN_NDAT1_ND3_Pos                     _U_(3)                                               /**< (CAN_NDAT1) New Data 3 Position */
#define CAN_NDAT1_ND3_Msk                     (_U_(0x1) << CAN_NDAT1_ND3_Pos)                      /**< (CAN_NDAT1) New Data 3 Mask */
#define CAN_NDAT1_ND3(value)                  (CAN_NDAT1_ND3_Msk & ((value) << CAN_NDAT1_ND3_Pos))
#define CAN_NDAT1_ND4_Pos                     _U_(4)                                               /**< (CAN_NDAT1) New Data 4 Position */
#define CAN_NDAT1_ND4_Msk                     (_U_(0x1) << CAN_NDAT1_ND4_Pos)                      /**< (CAN_NDAT1) New Data 4 Mask */
#define CAN_NDAT1_ND4(value)                  (CAN_NDAT1_ND4_Msk & ((value) << CAN_NDAT1_ND4_Pos))
#define CAN_NDAT1_ND5_Pos                     _U_(5)                                               /**< (CAN_NDAT1) New Data 5 Position */
#define CAN_NDAT1_ND5_Msk                     (_U_(0x1) << CAN_NDAT1_ND5_Pos)                      /**< (CAN_NDAT1) New Data 5 Mask */
#define CAN_NDAT1_ND5(value)                  (CAN_NDAT1_ND5_Msk & ((value) << CAN_NDAT1_ND5_Pos))
#define CAN_NDAT1_ND6_Pos                     _U_(6)                                               /**< (CAN_NDAT1) New Data 6 Position */
#define CAN_NDAT1_ND6_Msk                     (_U_(0x1) << CAN_NDAT1_ND6_Pos)                      /**< (CAN_NDAT1) New Data 6 Mask */
#define CAN_NDAT1_ND6(value)                  (CAN_NDAT1_ND6_Msk & ((value) << CAN_NDAT1_ND6_Pos))
#define CAN_NDAT1_ND7_Pos                     _U_(7)                                               /**< (CAN_NDAT1) New Data 7 Position */
#define CAN_NDAT1_ND7_Msk                     (_U_(0x1) << CAN_NDAT1_ND7_Pos)                      /**< (CAN_NDAT1) New Data 7 Mask */
#define CAN_NDAT1_ND7(value)                  (CAN_NDAT1_ND7_Msk & ((value) << CAN_NDAT1_ND7_Pos))
#define CAN_NDAT1_ND8_Pos                     _U_(8)                                               /**< (CAN_NDAT1) New Data 8 Position */
#define CAN_NDAT1_ND8_Msk                     (_U_(0x1) << CAN_NDAT1_ND8_Pos)                      /**< (CAN_NDAT1) New Data 8 Mask */
#define CAN_NDAT1_ND8(value)                  (CAN_NDAT1_ND8_Msk & ((value) << CAN_NDAT1_ND8_Pos))
#define CAN_NDAT1_ND9_Pos                     _U_(9)                                               /**< (CAN_NDAT1) New Data 9 Position */
#define CAN_NDAT1_ND9_Msk                     (_U_(0x1) << CAN_NDAT1_ND9_Pos)                      /**< (CAN_NDAT1) New Data 9 Mask */
#define CAN_NDAT1_ND9(value)                  (CAN_NDAT1_ND9_Msk & ((value) << CAN_NDAT1_ND9_Pos))
#define CAN_NDAT1_ND10_Pos                    _U_(10)                                              /**< (CAN_NDAT1) New Data 10 Position */
#define CAN_NDAT1_ND10_Msk                    (_U_(0x1) << CAN_NDAT1_ND10_Pos)                     /**< (CAN_NDAT1) New Data 10 Mask */
#define CAN_NDAT1_ND10(value)                 (CAN_NDAT1_ND10_Msk & ((value) << CAN_NDAT1_ND10_Pos))
#define CAN_NDAT1_ND11_Pos                    _U_(11)                                              /**< (CAN_NDAT1) New Data 11 Position */
#define CAN_NDAT1_ND11_Msk                    (_U_(0x1) << CAN_NDAT1_ND11_Pos)                     /**< (CAN_NDAT1) New Data 11 Mask */
#define CAN_NDAT1_ND11(value)                 (CAN_NDAT1_ND11_Msk & ((value) << CAN_NDAT1_ND11_Pos))
#define CAN_NDAT1_ND12_Pos                    _U_(12)                                              /**< (CAN_NDAT1) New Data 12 Position */
#define CAN_NDAT1_ND12_Msk                    (_U_(0x1) << CAN_NDAT1_ND12_Pos)                     /**< (CAN_NDAT1) New Data 12 Mask */
#define CAN_NDAT1_ND12(value)                 (CAN_NDAT1_ND12_Msk & ((value) << CAN_NDAT1_ND12_Pos))
#define CAN_NDAT1_ND13_Pos                    _U_(13)                                              /**< (CAN_NDAT1) New Data 13 Position */
#define CAN_NDAT1_ND13_Msk                    (_U_(0x1) << CAN_NDAT1_ND13_Pos)                     /**< (CAN_NDAT1) New Data 13 Mask */
#define CAN_NDAT1_ND13(value)                 (CAN_NDAT1_ND13_Msk & ((value) << CAN_NDAT1_ND13_Pos))
#define CAN_NDAT1_ND14_Pos                    _U_(14)                                              /**< (CAN_NDAT1) New Data 14 Position */
#define CAN_NDAT1_ND14_Msk                    (_U_(0x1) << CAN_NDAT1_ND14_Pos)                     /**< (CAN_NDAT1) New Data 14 Mask */
#define CAN_NDAT1_ND14(value)                 (CAN_NDAT1_ND14_Msk & ((value) << CAN_NDAT1_ND14_Pos))
#define CAN_NDAT1_ND15_Pos                    _U_(15)                                              /**< (CAN_NDAT1) New Data 15 Position */
#define CAN_NDAT1_ND15_Msk                    (_U_(0x1) << CAN_NDAT1_ND15_Pos)                     /**< (CAN_NDAT1) New Data 15 Mask */
#define CAN_NDAT1_ND15(value)                 (CAN_NDAT1_ND15_Msk & ((value) << CAN_NDAT1_ND15_Pos))
#define CAN_NDAT1_ND16_Pos                    _U_(16)                                              /**< (CAN_NDAT1) New Data 16 Position */
#define CAN_NDAT1_ND16_Msk                    (_U_(0x1) << CAN_NDAT1_ND16_Pos)                     /**< (CAN_NDAT1) New Data 16 Mask */
#define CAN_NDAT1_ND16(value)                 (CAN_NDAT1_ND16_Msk & ((value) << CAN_NDAT1_ND16_Pos))
#define CAN_NDAT1_ND17_Pos                    _U_(17)                                              /**< (CAN_NDAT1) New Data 17 Position */
#define CAN_NDAT1_ND17_Msk                    (_U_(0x1) << CAN_NDAT1_ND17_Pos)                     /**< (CAN_NDAT1) New Data 17 Mask */
#define CAN_NDAT1_ND17(value)                 (CAN_NDAT1_ND17_Msk & ((value) << CAN_NDAT1_ND17_Pos))
#define CAN_NDAT1_ND18_Pos                    _U_(18)                                              /**< (CAN_NDAT1) New Data 18 Position */
#define CAN_NDAT1_ND18_Msk                    (_U_(0x1) << CAN_NDAT1_ND18_Pos)                     /**< (CAN_NDAT1) New Data 18 Mask */
#define CAN_NDAT1_ND18(value)                 (CAN_NDAT1_ND18_Msk & ((value) << CAN_NDAT1_ND18_Pos))
#define CAN_NDAT1_ND19_Pos                    _U_(19)                                              /**< (CAN_NDAT1) New Data 19 Position */
#define CAN_NDAT1_ND19_Msk                    (_U_(0x1) << CAN_NDAT1_ND19_Pos)                     /**< (CAN_NDAT1) New Data 19 Mask */
#define CAN_NDAT1_ND19(value)                 (CAN_NDAT1_ND19_Msk & ((value) << CAN_NDAT1_ND19_Pos))
#define CAN_NDAT1_ND20_Pos                    _U_(20)                                              /**< (CAN_NDAT1) New Data 20 Position */
#define CAN_NDAT1_ND20_Msk                    (_U_(0x1) << CAN_NDAT1_ND20_Pos)                     /**< (CAN_NDAT1) New Data 20 Mask */
#define CAN_NDAT1_ND20(value)                 (CAN_NDAT1_ND20_Msk & ((value) << CAN_NDAT1_ND20_Pos))
#define CAN_NDAT1_ND21_Pos                    _U_(21)                                              /**< (CAN_NDAT1) New Data 21 Position */
#define CAN_NDAT1_ND21_Msk                    (_U_(0x1) << CAN_NDAT1_ND21_Pos)                     /**< (CAN_NDAT1) New Data 21 Mask */
#define CAN_NDAT1_ND21(value)                 (CAN_NDAT1_ND21_Msk & ((value) << CAN_NDAT1_ND21_Pos))
#define CAN_NDAT1_ND22_Pos                    _U_(22)                                              /**< (CAN_NDAT1) New Data 22 Position */
#define CAN_NDAT1_ND22_Msk                    (_U_(0x1) << CAN_NDAT1_ND22_Pos)                     /**< (CAN_NDAT1) New Data 22 Mask */
#define CAN_NDAT1_ND22(value)                 (CAN_NDAT1_ND22_Msk & ((value) << CAN_NDAT1_ND22_Pos))
#define CAN_NDAT1_ND23_Pos                    _U_(23)                                              /**< (CAN_NDAT1) New Data 23 Position */
#define CAN_NDAT1_ND23_Msk                    (_U_(0x1) << CAN_NDAT1_ND23_Pos)                     /**< (CAN_NDAT1) New Data 23 Mask */
#define CAN_NDAT1_ND23(value)                 (CAN_NDAT1_ND23_Msk & ((value) << CAN_NDAT1_ND23_Pos))
#define CAN_NDAT1_ND24_Pos                    _U_(24)                                              /**< (CAN_NDAT1) New Data 24 Position */
#define CAN_NDAT1_ND24_Msk                    (_U_(0x1) << CAN_NDAT1_ND24_Pos)                     /**< (CAN_NDAT1) New Data 24 Mask */
#define CAN_NDAT1_ND24(value)                 (CAN_NDAT1_ND24_Msk & ((value) << CAN_NDAT1_ND24_Pos))
#define CAN_NDAT1_ND25_Pos                    _U_(25)                                              /**< (CAN_NDAT1) New Data 25 Position */
#define CAN_NDAT1_ND25_Msk                    (_U_(0x1) << CAN_NDAT1_ND25_Pos)                     /**< (CAN_NDAT1) New Data 25 Mask */
#define CAN_NDAT1_ND25(value)                 (CAN_NDAT1_ND25_Msk & ((value) << CAN_NDAT1_ND25_Pos))
#define CAN_NDAT1_ND26_Pos                    _U_(26)                                              /**< (CAN_NDAT1) New Data 26 Position */
#define CAN_NDAT1_ND26_Msk                    (_U_(0x1) << CAN_NDAT1_ND26_Pos)                     /**< (CAN_NDAT1) New Data 26 Mask */
#define CAN_NDAT1_ND26(value)                 (CAN_NDAT1_ND26_Msk & ((value) << CAN_NDAT1_ND26_Pos))
#define CAN_NDAT1_ND27_Pos                    _U_(27)                                              /**< (CAN_NDAT1) New Data 27 Position */
#define CAN_NDAT1_ND27_Msk                    (_U_(0x1) << CAN_NDAT1_ND27_Pos)                     /**< (CAN_NDAT1) New Data 27 Mask */
#define CAN_NDAT1_ND27(value)                 (CAN_NDAT1_ND27_Msk & ((value) << CAN_NDAT1_ND27_Pos))
#define CAN_NDAT1_ND28_Pos                    _U_(28)                                              /**< (CAN_NDAT1) New Data 28 Position */
#define CAN_NDAT1_ND28_Msk                    (_U_(0x1) << CAN_NDAT1_ND28_Pos)                     /**< (CAN_NDAT1) New Data 28 Mask */
#define CAN_NDAT1_ND28(value)                 (CAN_NDAT1_ND28_Msk & ((value) << CAN_NDAT1_ND28_Pos))
#define CAN_NDAT1_ND29_Pos                    _U_(29)                                              /**< (CAN_NDAT1) New Data 29 Position */
#define CAN_NDAT1_ND29_Msk                    (_U_(0x1) << CAN_NDAT1_ND29_Pos)                     /**< (CAN_NDAT1) New Data 29 Mask */
#define CAN_NDAT1_ND29(value)                 (CAN_NDAT1_ND29_Msk & ((value) << CAN_NDAT1_ND29_Pos))
#define CAN_NDAT1_ND30_Pos                    _U_(30)                                              /**< (CAN_NDAT1) New Data 30 Position */
#define CAN_NDAT1_ND30_Msk                    (_U_(0x1) << CAN_NDAT1_ND30_Pos)                     /**< (CAN_NDAT1) New Data 30 Mask */
#define CAN_NDAT1_ND30(value)                 (CAN_NDAT1_ND30_Msk & ((value) << CAN_NDAT1_ND30_Pos))
#define CAN_NDAT1_ND31_Pos                    _U_(31)                                              /**< (CAN_NDAT1) New Data 31 Position */
#define CAN_NDAT1_ND31_Msk                    (_U_(0x1) << CAN_NDAT1_ND31_Pos)                     /**< (CAN_NDAT1) New Data 31 Mask */
#define CAN_NDAT1_ND31(value)                 (CAN_NDAT1_ND31_Msk & ((value) << CAN_NDAT1_ND31_Pos))
#define CAN_NDAT1_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_NDAT1) Register Mask  */

