bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/component/can.h
#define CAN_TXBTO_TO_Pos                      _U_(0)                                               /**< (CAN_TXBTO Position) Transmission Occurred 3x */
#define CAN_TXBTO_TO_Msk                      (_U_(0xFFFFFFFF) << CAN_TXBTO_TO_Pos)                /**< (CAN_TXBTO Mask) TO */
#define CAN_TXBTO_TO(value)                   (CAN_TXBTO_TO_Msk & ((value) << CAN_TXBTO_TO_Pos))   

/* -------- CAN_TXBCF : (CAN Offset: 0xDC) ( R/ 32) Tx Buffer Cancellation Finished -------- */
#define CAN_TXBCF_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXBCF) Tx Buffer Cancellation Finished  Reset Value */

#define CAN_TXBCF_CF0_Pos                     _U_(0)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 0 Position */
#define CAN_TXBCF_CF0_Msk                     (_U_(0x1) << CAN_TXBCF_CF0_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 0 Mask */
#define CAN_TXBCF_CF0(value)                  (CAN_TXBCF_CF0_Msk & ((value) << CAN_TXBCF_CF0_Pos))
#define CAN_TXBCF_CF1_Pos                     _U_(1)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 1 Position */
#define CAN_TXBCF_CF1_Msk                     (_U_(0x1) << CAN_TXBCF_CF1_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 1 Mask */
#define CAN_TXBCF_CF1(value)                  (CAN_TXBCF_CF1_Msk & ((value) << CAN_TXBCF_CF1_Pos))
#define CAN_TXBCF_CF2_Pos                     _U_(2)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 2 Position */
#define CAN_TXBCF_CF2_Msk                     (_U_(0x1) << CAN_TXBCF_CF2_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 2 Mask */
#define CAN_TXBCF_CF2(value)                  (CAN_TXBCF_CF2_Msk & ((value) << CAN_TXBCF_CF2_Pos))
#define CAN_TXBCF_CF3_Pos                     _U_(3)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 3 Position */
#define CAN_TXBCF_CF3_Msk                     (_U_(0x1) << CAN_TXBCF_CF3_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 3 Mask */
#define CAN_TXBCF_CF3(value)                  (CAN_TXBCF_CF3_Msk & ((value) << CAN_TXBCF_CF3_Pos))
#define CAN_TXBCF_CF4_Pos                     _U_(4)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 4 Position */
#define CAN_TXBCF_CF4_Msk                     (_U_(0x1) << CAN_TXBCF_CF4_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 4 Mask */
#define CAN_TXBCF_CF4(value)                  (CAN_TXBCF_CF4_Msk & ((value) << CAN_TXBCF_CF4_Pos))
#define CAN_TXBCF_CF5_Pos                     _U_(5)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 5 Position */
#define CAN_TXBCF_CF5_Msk                     (_U_(0x1) << CAN_TXBCF_CF5_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 5 Mask */
#define CAN_TXBCF_CF5(value)                  (CAN_TXBCF_CF5_Msk & ((value) << CAN_TXBCF_CF5_Pos))
#define CAN_TXBCF_CF6_Pos                     _U_(6)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 6 Position */
#define CAN_TXBCF_CF6_Msk                     (_U_(0x1) << CAN_TXBCF_CF6_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 6 Mask */
#define CAN_TXBCF_CF6(value)                  (CAN_TXBCF_CF6_Msk & ((value) << CAN_TXBCF_CF6_Pos))
#define CAN_TXBCF_CF7_Pos                     _U_(7)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 7 Position */
#define CAN_TXBCF_CF7_Msk                     (_U_(0x1) << CAN_TXBCF_CF7_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 7 Mask */
#define CAN_TXBCF_CF7(value)                  (CAN_TXBCF_CF7_Msk & ((value) << CAN_TXBCF_CF7_Pos))
#define CAN_TXBCF_CF8_Pos                     _U_(8)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 8 Position */
#define CAN_TXBCF_CF8_Msk                     (_U_(0x1) << CAN_TXBCF_CF8_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 8 Mask */
#define CAN_TXBCF_CF8(value)                  (CAN_TXBCF_CF8_Msk & ((value) << CAN_TXBCF_CF8_Pos))
#define CAN_TXBCF_CF9_Pos                     _U_(9)                                               /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 9 Position */
#define CAN_TXBCF_CF9_Msk                     (_U_(0x1) << CAN_TXBCF_CF9_Pos)                      /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 9 Mask */
#define CAN_TXBCF_CF9(value)                  (CAN_TXBCF_CF9_Msk & ((value) << CAN_TXBCF_CF9_Pos))
#define CAN_TXBCF_CF10_Pos                    _U_(10)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 10 Position */
#define CAN_TXBCF_CF10_Msk                    (_U_(0x1) << CAN_TXBCF_CF10_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 10 Mask */
#define CAN_TXBCF_CF10(value)                 (CAN_TXBCF_CF10_Msk & ((value) << CAN_TXBCF_CF10_Pos))
#define CAN_TXBCF_CF11_Pos                    _U_(11)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 11 Position */
#define CAN_TXBCF_CF11_Msk                    (_U_(0x1) << CAN_TXBCF_CF11_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 11 Mask */
#define CAN_TXBCF_CF11(value)                 (CAN_TXBCF_CF11_Msk & ((value) << CAN_TXBCF_CF11_Pos))
#define CAN_TXBCF_CF12_Pos                    _U_(12)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 12 Position */
#define CAN_TXBCF_CF12_Msk                    (_U_(0x1) << CAN_TXBCF_CF12_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 12 Mask */
#define CAN_TXBCF_CF12(value)                 (CAN_TXBCF_CF12_Msk & ((value) << CAN_TXBCF_CF12_Pos))
#define CAN_TXBCF_CF13_Pos                    _U_(13)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 13 Position */
#define CAN_TXBCF_CF13_Msk                    (_U_(0x1) << CAN_TXBCF_CF13_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 13 Mask */
#define CAN_TXBCF_CF13(value)                 (CAN_TXBCF_CF13_Msk & ((value) << CAN_TXBCF_CF13_Pos))
#define CAN_TXBCF_CF14_Pos                    _U_(14)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 14 Position */
#define CAN_TXBCF_CF14_Msk                    (_U_(0x1) << CAN_TXBCF_CF14_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 14 Mask */
#define CAN_TXBCF_CF14(value)                 (CAN_TXBCF_CF14_Msk & ((value) << CAN_TXBCF_CF14_Pos))
#define CAN_TXBCF_CF15_Pos                    _U_(15)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 15 Position */
#define CAN_TXBCF_CF15_Msk                    (_U_(0x1) << CAN_TXBCF_CF15_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 15 Mask */
#define CAN_TXBCF_CF15(value)                 (CAN_TXBCF_CF15_Msk & ((value) << CAN_TXBCF_CF15_Pos))
#define CAN_TXBCF_CF16_Pos                    _U_(16)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 16 Position */
#define CAN_TXBCF_CF16_Msk                    (_U_(0x1) << CAN_TXBCF_CF16_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 16 Mask */
#define CAN_TXBCF_CF16(value)                 (CAN_TXBCF_CF16_Msk & ((value) << CAN_TXBCF_CF16_Pos))
#define CAN_TXBCF_CF17_Pos                    _U_(17)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 17 Position */
#define CAN_TXBCF_CF17_Msk                    (_U_(0x1) << CAN_TXBCF_CF17_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 17 Mask */
#define CAN_TXBCF_CF17(value)                 (CAN_TXBCF_CF17_Msk & ((value) << CAN_TXBCF_CF17_Pos))
#define CAN_TXBCF_CF18_Pos                    _U_(18)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 18 Position */
#define CAN_TXBCF_CF18_Msk                    (_U_(0x1) << CAN_TXBCF_CF18_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 18 Mask */
#define CAN_TXBCF_CF18(value)                 (CAN_TXBCF_CF18_Msk & ((value) << CAN_TXBCF_CF18_Pos))
#define CAN_TXBCF_CF19_Pos                    _U_(19)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 19 Position */
#define CAN_TXBCF_CF19_Msk                    (_U_(0x1) << CAN_TXBCF_CF19_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 19 Mask */
#define CAN_TXBCF_CF19(value)                 (CAN_TXBCF_CF19_Msk & ((value) << CAN_TXBCF_CF19_Pos))
#define CAN_TXBCF_CF20_Pos                    _U_(20)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 20 Position */
#define CAN_TXBCF_CF20_Msk                    (_U_(0x1) << CAN_TXBCF_CF20_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 20 Mask */
#define CAN_TXBCF_CF20(value)                 (CAN_TXBCF_CF20_Msk & ((value) << CAN_TXBCF_CF20_Pos))
#define CAN_TXBCF_CF21_Pos                    _U_(21)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 21 Position */
#define CAN_TXBCF_CF21_Msk                    (_U_(0x1) << CAN_TXBCF_CF21_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 21 Mask */
#define CAN_TXBCF_CF21(value)                 (CAN_TXBCF_CF21_Msk & ((value) << CAN_TXBCF_CF21_Pos))
#define CAN_TXBCF_CF22_Pos                    _U_(22)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 22 Position */
#define CAN_TXBCF_CF22_Msk                    (_U_(0x1) << CAN_TXBCF_CF22_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 22 Mask */
#define CAN_TXBCF_CF22(value)                 (CAN_TXBCF_CF22_Msk & ((value) << CAN_TXBCF_CF22_Pos))
#define CAN_TXBCF_CF23_Pos                    _U_(23)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 23 Position */
#define CAN_TXBCF_CF23_Msk                    (_U_(0x1) << CAN_TXBCF_CF23_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 23 Mask */
#define CAN_TXBCF_CF23(value)                 (CAN_TXBCF_CF23_Msk & ((value) << CAN_TXBCF_CF23_Pos))
#define CAN_TXBCF_CF24_Pos                    _U_(24)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 24 Position */
#define CAN_TXBCF_CF24_Msk                    (_U_(0x1) << CAN_TXBCF_CF24_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 24 Mask */
#define CAN_TXBCF_CF24(value)                 (CAN_TXBCF_CF24_Msk & ((value) << CAN_TXBCF_CF24_Pos))
#define CAN_TXBCF_CF25_Pos                    _U_(25)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 25 Position */
#define CAN_TXBCF_CF25_Msk                    (_U_(0x1) << CAN_TXBCF_CF25_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 25 Mask */
#define CAN_TXBCF_CF25(value)                 (CAN_TXBCF_CF25_Msk & ((value) << CAN_TXBCF_CF25_Pos))
#define CAN_TXBCF_CF26_Pos                    _U_(26)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 26 Position */
#define CAN_TXBCF_CF26_Msk                    (_U_(0x1) << CAN_TXBCF_CF26_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 26 Mask */
#define CAN_TXBCF_CF26(value)                 (CAN_TXBCF_CF26_Msk & ((value) << CAN_TXBCF_CF26_Pos))
#define CAN_TXBCF_CF27_Pos                    _U_(27)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 27 Position */
#define CAN_TXBCF_CF27_Msk                    (_U_(0x1) << CAN_TXBCF_CF27_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 27 Mask */
#define CAN_TXBCF_CF27(value)                 (CAN_TXBCF_CF27_Msk & ((value) << CAN_TXBCF_CF27_Pos))
#define CAN_TXBCF_CF28_Pos                    _U_(28)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 28 Position */
#define CAN_TXBCF_CF28_Msk                    (_U_(0x1) << CAN_TXBCF_CF28_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 28 Mask */
#define CAN_TXBCF_CF28(value)                 (CAN_TXBCF_CF28_Msk & ((value) << CAN_TXBCF_CF28_Pos))
#define CAN_TXBCF_CF29_Pos                    _U_(29)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 29 Position */
#define CAN_TXBCF_CF29_Msk                    (_U_(0x1) << CAN_TXBCF_CF29_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 29 Mask */
#define CAN_TXBCF_CF29(value)                 (CAN_TXBCF_CF29_Msk & ((value) << CAN_TXBCF_CF29_Pos))
#define CAN_TXBCF_CF30_Pos                    _U_(30)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 30 Position */
#define CAN_TXBCF_CF30_Msk                    (_U_(0x1) << CAN_TXBCF_CF30_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 30 Mask */
#define CAN_TXBCF_CF30(value)                 (CAN_TXBCF_CF30_Msk & ((value) << CAN_TXBCF_CF30_Pos))
#define CAN_TXBCF_CF31_Pos                    _U_(31)                                              /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 31 Position */
#define CAN_TXBCF_CF31_Msk                    (_U_(0x1) << CAN_TXBCF_CF31_Pos)                     /**< (CAN_TXBCF) Tx Buffer Cancellation Finished 31 Mask */
#define CAN_TXBCF_CF31(value)                 (CAN_TXBCF_CF31_Msk & ((value) << CAN_TXBCF_CF31_Pos))
#define CAN_TXBCF_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_TXBCF) Register Mask  */

#define CAN_TXBCF_CF_Pos                      _U_(0)                                               /**< (CAN_TXBCF Position) Tx Buffer Cancellation Finished 3x */
#define CAN_TXBCF_CF_Msk                      (_U_(0xFFFFFFFF) << CAN_TXBCF_CF_Pos)                /**< (CAN_TXBCF Mask) CF */
#define CAN_TXBCF_CF(value)                   (CAN_TXBCF_CF_Msk & ((value) << CAN_TXBCF_CF_Pos))   

/* -------- CAN_TXBTIE : (CAN Offset: 0xE0) (R/W 32) Tx Buffer Transmission Interrupt Enable -------- */
#define CAN_TXBTIE_RESETVALUE                 _U_(0x00)                                            /**<  (CAN_TXBTIE) Tx Buffer Transmission Interrupt Enable  Reset Value */

