bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/component/can.h
#define CAN_TXBTIE_TIE0_Pos                   _U_(0)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 0 Position */
#define CAN_TXBTIE_TIE0_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE0_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 0 Mask */
#define CAN_TXBTIE_TIE0(value)                (CAN_TXBTIE_TIE0_Msk & ((value) << CAN_TXBTIE_TIE0_Pos))
#define CAN_TXBTIE_TIE1_Pos                   _U_(1)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 1 Position */
#define CAN_TXBTIE_TIE1_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE1_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 1 Mask */
#define CAN_TXBTIE_TIE1(value)                (CAN_TXBTIE_TIE1_Msk & ((value) << CAN_TXBTIE_TIE1_Pos))
#define CAN_TXBTIE_TIE2_Pos                   _U_(2)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 2 Position */
#define CAN_TXBTIE_TIE2_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE2_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 2 Mask */
#define CAN_TXBTIE_TIE2(value)                (CAN_TXBTIE_TIE2_Msk & ((value) << CAN_TXBTIE_TIE2_Pos))
#define CAN_TXBTIE_TIE3_Pos                   _U_(3)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 3 Position */
#define CAN_TXBTIE_TIE3_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE3_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 3 Mask */
#define CAN_TXBTIE_TIE3(value)                (CAN_TXBTIE_TIE3_Msk & ((value) << CAN_TXBTIE_TIE3_Pos))
#define CAN_TXBTIE_TIE4_Pos                   _U_(4)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 4 Position */
#define CAN_TXBTIE_TIE4_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE4_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 4 Mask */
#define CAN_TXBTIE_TIE4(value)                (CAN_TXBTIE_TIE4_Msk & ((value) << CAN_TXBTIE_TIE4_Pos))
#define CAN_TXBTIE_TIE5_Pos                   _U_(5)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 5 Position */
#define CAN_TXBTIE_TIE5_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE5_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 5 Mask */
#define CAN_TXBTIE_TIE5(value)                (CAN_TXBTIE_TIE5_Msk & ((value) << CAN_TXBTIE_TIE5_Pos))
#define CAN_TXBTIE_TIE6_Pos                   _U_(6)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 6 Position */
#define CAN_TXBTIE_TIE6_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE6_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 6 Mask */
#define CAN_TXBTIE_TIE6(value)                (CAN_TXBTIE_TIE6_Msk & ((value) << CAN_TXBTIE_TIE6_Pos))
#define CAN_TXBTIE_TIE7_Pos                   _U_(7)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 7 Position */
#define CAN_TXBTIE_TIE7_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE7_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 7 Mask */
#define CAN_TXBTIE_TIE7(value)                (CAN_TXBTIE_TIE7_Msk & ((value) << CAN_TXBTIE_TIE7_Pos))
#define CAN_TXBTIE_TIE8_Pos                   _U_(8)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 8 Position */
#define CAN_TXBTIE_TIE8_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE8_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 8 Mask */
#define CAN_TXBTIE_TIE8(value)                (CAN_TXBTIE_TIE8_Msk & ((value) << CAN_TXBTIE_TIE8_Pos))
#define CAN_TXBTIE_TIE9_Pos                   _U_(9)                                               /**< (CAN_TXBTIE) Transmission Interrupt Enable 9 Position */
#define CAN_TXBTIE_TIE9_Msk                   (_U_(0x1) << CAN_TXBTIE_TIE9_Pos)                    /**< (CAN_TXBTIE) Transmission Interrupt Enable 9 Mask */
#define CAN_TXBTIE_TIE9(value)                (CAN_TXBTIE_TIE9_Msk & ((value) << CAN_TXBTIE_TIE9_Pos))
#define CAN_TXBTIE_TIE10_Pos                  _U_(10)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 10 Position */
#define CAN_TXBTIE_TIE10_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE10_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 10 Mask */
#define CAN_TXBTIE_TIE10(value)               (CAN_TXBTIE_TIE10_Msk & ((value) << CAN_TXBTIE_TIE10_Pos))
#define CAN_TXBTIE_TIE11_Pos                  _U_(11)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 11 Position */
#define CAN_TXBTIE_TIE11_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE11_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 11 Mask */
#define CAN_TXBTIE_TIE11(value)               (CAN_TXBTIE_TIE11_Msk & ((value) << CAN_TXBTIE_TIE11_Pos))
#define CAN_TXBTIE_TIE12_Pos                  _U_(12)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 12 Position */
#define CAN_TXBTIE_TIE12_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE12_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 12 Mask */
#define CAN_TXBTIE_TIE12(value)               (CAN_TXBTIE_TIE12_Msk & ((value) << CAN_TXBTIE_TIE12_Pos))
#define CAN_TXBTIE_TIE13_Pos                  _U_(13)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 13 Position */
#define CAN_TXBTIE_TIE13_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE13_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 13 Mask */
#define CAN_TXBTIE_TIE13(value)               (CAN_TXBTIE_TIE13_Msk & ((value) << CAN_TXBTIE_TIE13_Pos))
#define CAN_TXBTIE_TIE14_Pos                  _U_(14)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 14 Position */
#define CAN_TXBTIE_TIE14_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE14_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 14 Mask */
#define CAN_TXBTIE_TIE14(value)               (CAN_TXBTIE_TIE14_Msk & ((value) << CAN_TXBTIE_TIE14_Pos))
#define CAN_TXBTIE_TIE15_Pos                  _U_(15)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 15 Position */
#define CAN_TXBTIE_TIE15_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE15_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 15 Mask */
#define CAN_TXBTIE_TIE15(value)               (CAN_TXBTIE_TIE15_Msk & ((value) << CAN_TXBTIE_TIE15_Pos))
#define CAN_TXBTIE_TIE16_Pos                  _U_(16)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 16 Position */
#define CAN_TXBTIE_TIE16_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE16_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 16 Mask */
#define CAN_TXBTIE_TIE16(value)               (CAN_TXBTIE_TIE16_Msk & ((value) << CAN_TXBTIE_TIE16_Pos))
#define CAN_TXBTIE_TIE17_Pos                  _U_(17)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 17 Position */
#define CAN_TXBTIE_TIE17_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE17_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 17 Mask */
#define CAN_TXBTIE_TIE17(value)               (CAN_TXBTIE_TIE17_Msk & ((value) << CAN_TXBTIE_TIE17_Pos))
#define CAN_TXBTIE_TIE18_Pos                  _U_(18)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 18 Position */
#define CAN_TXBTIE_TIE18_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE18_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 18 Mask */
#define CAN_TXBTIE_TIE18(value)               (CAN_TXBTIE_TIE18_Msk & ((value) << CAN_TXBTIE_TIE18_Pos))
#define CAN_TXBTIE_TIE19_Pos                  _U_(19)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 19 Position */
#define CAN_TXBTIE_TIE19_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE19_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 19 Mask */
#define CAN_TXBTIE_TIE19(value)               (CAN_TXBTIE_TIE19_Msk & ((value) << CAN_TXBTIE_TIE19_Pos))
#define CAN_TXBTIE_TIE20_Pos                  _U_(20)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 20 Position */
#define CAN_TXBTIE_TIE20_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE20_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 20 Mask */
#define CAN_TXBTIE_TIE20(value)               (CAN_TXBTIE_TIE20_Msk & ((value) << CAN_TXBTIE_TIE20_Pos))
#define CAN_TXBTIE_TIE21_Pos                  _U_(21)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 21 Position */
#define CAN_TXBTIE_TIE21_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE21_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 21 Mask */
#define CAN_TXBTIE_TIE21(value)               (CAN_TXBTIE_TIE21_Msk & ((value) << CAN_TXBTIE_TIE21_Pos))
#define CAN_TXBTIE_TIE22_Pos                  _U_(22)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 22 Position */
#define CAN_TXBTIE_TIE22_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE22_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 22 Mask */
#define CAN_TXBTIE_TIE22(value)               (CAN_TXBTIE_TIE22_Msk & ((value) << CAN_TXBTIE_TIE22_Pos))
#define CAN_TXBTIE_TIE23_Pos                  _U_(23)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 23 Position */
#define CAN_TXBTIE_TIE23_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE23_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 23 Mask */
#define CAN_TXBTIE_TIE23(value)               (CAN_TXBTIE_TIE23_Msk & ((value) << CAN_TXBTIE_TIE23_Pos))
#define CAN_TXBTIE_TIE24_Pos                  _U_(24)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 24 Position */
#define CAN_TXBTIE_TIE24_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE24_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 24 Mask */
#define CAN_TXBTIE_TIE24(value)               (CAN_TXBTIE_TIE24_Msk & ((value) << CAN_TXBTIE_TIE24_Pos))
#define CAN_TXBTIE_TIE25_Pos                  _U_(25)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 25 Position */
#define CAN_TXBTIE_TIE25_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE25_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 25 Mask */
#define CAN_TXBTIE_TIE25(value)               (CAN_TXBTIE_TIE25_Msk & ((value) << CAN_TXBTIE_TIE25_Pos))
#define CAN_TXBTIE_TIE26_Pos                  _U_(26)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 26 Position */
#define CAN_TXBTIE_TIE26_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE26_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 26 Mask */
#define CAN_TXBTIE_TIE26(value)               (CAN_TXBTIE_TIE26_Msk & ((value) << CAN_TXBTIE_TIE26_Pos))
#define CAN_TXBTIE_TIE27_Pos                  _U_(27)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 27 Position */
#define CAN_TXBTIE_TIE27_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE27_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 27 Mask */
#define CAN_TXBTIE_TIE27(value)               (CAN_TXBTIE_TIE27_Msk & ((value) << CAN_TXBTIE_TIE27_Pos))
#define CAN_TXBTIE_TIE28_Pos                  _U_(28)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 28 Position */
#define CAN_TXBTIE_TIE28_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE28_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 28 Mask */
#define CAN_TXBTIE_TIE28(value)               (CAN_TXBTIE_TIE28_Msk & ((value) << CAN_TXBTIE_TIE28_Pos))
#define CAN_TXBTIE_TIE29_Pos                  _U_(29)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 29 Position */
#define CAN_TXBTIE_TIE29_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE29_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 29 Mask */
#define CAN_TXBTIE_TIE29(value)               (CAN_TXBTIE_TIE29_Msk & ((value) << CAN_TXBTIE_TIE29_Pos))
#define CAN_TXBTIE_TIE30_Pos                  _U_(30)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 30 Position */
#define CAN_TXBTIE_TIE30_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE30_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 30 Mask */
#define CAN_TXBTIE_TIE30(value)               (CAN_TXBTIE_TIE30_Msk & ((value) << CAN_TXBTIE_TIE30_Pos))
#define CAN_TXBTIE_TIE31_Pos                  _U_(31)                                              /**< (CAN_TXBTIE) Transmission Interrupt Enable 31 Position */
#define CAN_TXBTIE_TIE31_Msk                  (_U_(0x1) << CAN_TXBTIE_TIE31_Pos)                   /**< (CAN_TXBTIE) Transmission Interrupt Enable 31 Mask */
#define CAN_TXBTIE_TIE31(value)               (CAN_TXBTIE_TIE31_Msk & ((value) << CAN_TXBTIE_TIE31_Pos))
#define CAN_TXBTIE_Msk                        _U_(0xFFFFFFFF)                                      /**< (CAN_TXBTIE) Register Mask  */

#define CAN_TXBTIE_TIE_Pos                    _U_(0)                                               /**< (CAN_TXBTIE Position) Transmission Interrupt Enable 3x */
#define CAN_TXBTIE_TIE_Msk                    (_U_(0xFFFFFFFF) << CAN_TXBTIE_TIE_Pos)              /**< (CAN_TXBTIE Mask) TIE */
#define CAN_TXBTIE_TIE(value)                 (CAN_TXBTIE_TIE_Msk & ((value) << CAN_TXBTIE_TIE_Pos)) 

