bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/component/can.h
/* -------- CAN_TXBCIE : (CAN Offset: 0xE4) (R/W 32) Tx Buffer Cancellation Finished Interrupt Enable -------- */
#define CAN_TXBCIE_RESETVALUE                 _U_(0x00)                                            /**<  (CAN_TXBCIE) Tx Buffer Cancellation Finished Interrupt Enable  Reset Value */

#define CAN_TXBCIE_CFIE0_Pos                  _U_(0)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 0 Position */
#define CAN_TXBCIE_CFIE0_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE0_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 0 Mask */
#define CAN_TXBCIE_CFIE0(value)               (CAN_TXBCIE_CFIE0_Msk & ((value) << CAN_TXBCIE_CFIE0_Pos))
#define CAN_TXBCIE_CFIE1_Pos                  _U_(1)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 1 Position */
#define CAN_TXBCIE_CFIE1_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE1_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 1 Mask */
#define CAN_TXBCIE_CFIE1(value)               (CAN_TXBCIE_CFIE1_Msk & ((value) << CAN_TXBCIE_CFIE1_Pos))
#define CAN_TXBCIE_CFIE2_Pos                  _U_(2)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 2 Position */
#define CAN_TXBCIE_CFIE2_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE2_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 2 Mask */
#define CAN_TXBCIE_CFIE2(value)               (CAN_TXBCIE_CFIE2_Msk & ((value) << CAN_TXBCIE_CFIE2_Pos))
#define CAN_TXBCIE_CFIE3_Pos                  _U_(3)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 3 Position */
#define CAN_TXBCIE_CFIE3_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE3_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 3 Mask */
#define CAN_TXBCIE_CFIE3(value)               (CAN_TXBCIE_CFIE3_Msk & ((value) << CAN_TXBCIE_CFIE3_Pos))
#define CAN_TXBCIE_CFIE4_Pos                  _U_(4)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 4 Position */
#define CAN_TXBCIE_CFIE4_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE4_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 4 Mask */
#define CAN_TXBCIE_CFIE4(value)               (CAN_TXBCIE_CFIE4_Msk & ((value) << CAN_TXBCIE_CFIE4_Pos))
#define CAN_TXBCIE_CFIE5_Pos                  _U_(5)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 5 Position */
#define CAN_TXBCIE_CFIE5_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE5_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 5 Mask */
#define CAN_TXBCIE_CFIE5(value)               (CAN_TXBCIE_CFIE5_Msk & ((value) << CAN_TXBCIE_CFIE5_Pos))
#define CAN_TXBCIE_CFIE6_Pos                  _U_(6)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 6 Position */
#define CAN_TXBCIE_CFIE6_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE6_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 6 Mask */
#define CAN_TXBCIE_CFIE6(value)               (CAN_TXBCIE_CFIE6_Msk & ((value) << CAN_TXBCIE_CFIE6_Pos))
#define CAN_TXBCIE_CFIE7_Pos                  _U_(7)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 7 Position */
#define CAN_TXBCIE_CFIE7_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE7_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 7 Mask */
#define CAN_TXBCIE_CFIE7(value)               (CAN_TXBCIE_CFIE7_Msk & ((value) << CAN_TXBCIE_CFIE7_Pos))
#define CAN_TXBCIE_CFIE8_Pos                  _U_(8)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 8 Position */
#define CAN_TXBCIE_CFIE8_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE8_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 8 Mask */
#define CAN_TXBCIE_CFIE8(value)               (CAN_TXBCIE_CFIE8_Msk & ((value) << CAN_TXBCIE_CFIE8_Pos))
#define CAN_TXBCIE_CFIE9_Pos                  _U_(9)                                               /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 9 Position */
#define CAN_TXBCIE_CFIE9_Msk                  (_U_(0x1) << CAN_TXBCIE_CFIE9_Pos)                   /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 9 Mask */
#define CAN_TXBCIE_CFIE9(value)               (CAN_TXBCIE_CFIE9_Msk & ((value) << CAN_TXBCIE_CFIE9_Pos))
#define CAN_TXBCIE_CFIE10_Pos                 _U_(10)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 10 Position */
#define CAN_TXBCIE_CFIE10_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE10_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 10 Mask */
#define CAN_TXBCIE_CFIE10(value)              (CAN_TXBCIE_CFIE10_Msk & ((value) << CAN_TXBCIE_CFIE10_Pos))
#define CAN_TXBCIE_CFIE11_Pos                 _U_(11)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 11 Position */
#define CAN_TXBCIE_CFIE11_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE11_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 11 Mask */
#define CAN_TXBCIE_CFIE11(value)              (CAN_TXBCIE_CFIE11_Msk & ((value) << CAN_TXBCIE_CFIE11_Pos))
#define CAN_TXBCIE_CFIE12_Pos                 _U_(12)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 12 Position */
#define CAN_TXBCIE_CFIE12_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE12_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 12 Mask */
#define CAN_TXBCIE_CFIE12(value)              (CAN_TXBCIE_CFIE12_Msk & ((value) << CAN_TXBCIE_CFIE12_Pos))
#define CAN_TXBCIE_CFIE13_Pos                 _U_(13)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 13 Position */
#define CAN_TXBCIE_CFIE13_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE13_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 13 Mask */
#define CAN_TXBCIE_CFIE13(value)              (CAN_TXBCIE_CFIE13_Msk & ((value) << CAN_TXBCIE_CFIE13_Pos))
#define CAN_TXBCIE_CFIE14_Pos                 _U_(14)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 14 Position */
#define CAN_TXBCIE_CFIE14_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE14_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 14 Mask */
#define CAN_TXBCIE_CFIE14(value)              (CAN_TXBCIE_CFIE14_Msk & ((value) << CAN_TXBCIE_CFIE14_Pos))
#define CAN_TXBCIE_CFIE15_Pos                 _U_(15)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 15 Position */
#define CAN_TXBCIE_CFIE15_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE15_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 15 Mask */
#define CAN_TXBCIE_CFIE15(value)              (CAN_TXBCIE_CFIE15_Msk & ((value) << CAN_TXBCIE_CFIE15_Pos))
#define CAN_TXBCIE_CFIE16_Pos                 _U_(16)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 16 Position */
#define CAN_TXBCIE_CFIE16_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE16_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 16 Mask */
#define CAN_TXBCIE_CFIE16(value)              (CAN_TXBCIE_CFIE16_Msk & ((value) << CAN_TXBCIE_CFIE16_Pos))
#define CAN_TXBCIE_CFIE17_Pos                 _U_(17)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 17 Position */
#define CAN_TXBCIE_CFIE17_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE17_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 17 Mask */
#define CAN_TXBCIE_CFIE17(value)              (CAN_TXBCIE_CFIE17_Msk & ((value) << CAN_TXBCIE_CFIE17_Pos))
#define CAN_TXBCIE_CFIE18_Pos                 _U_(18)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 18 Position */
#define CAN_TXBCIE_CFIE18_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE18_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 18 Mask */
#define CAN_TXBCIE_CFIE18(value)              (CAN_TXBCIE_CFIE18_Msk & ((value) << CAN_TXBCIE_CFIE18_Pos))
#define CAN_TXBCIE_CFIE19_Pos                 _U_(19)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 19 Position */
#define CAN_TXBCIE_CFIE19_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE19_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 19 Mask */
#define CAN_TXBCIE_CFIE19(value)              (CAN_TXBCIE_CFIE19_Msk & ((value) << CAN_TXBCIE_CFIE19_Pos))
#define CAN_TXBCIE_CFIE20_Pos                 _U_(20)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 20 Position */
#define CAN_TXBCIE_CFIE20_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE20_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 20 Mask */
#define CAN_TXBCIE_CFIE20(value)              (CAN_TXBCIE_CFIE20_Msk & ((value) << CAN_TXBCIE_CFIE20_Pos))
#define CAN_TXBCIE_CFIE21_Pos                 _U_(21)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 21 Position */
#define CAN_TXBCIE_CFIE21_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE21_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 21 Mask */
#define CAN_TXBCIE_CFIE21(value)              (CAN_TXBCIE_CFIE21_Msk & ((value) << CAN_TXBCIE_CFIE21_Pos))
#define CAN_TXBCIE_CFIE22_Pos                 _U_(22)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 22 Position */
#define CAN_TXBCIE_CFIE22_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE22_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 22 Mask */
#define CAN_TXBCIE_CFIE22(value)              (CAN_TXBCIE_CFIE22_Msk & ((value) << CAN_TXBCIE_CFIE22_Pos))
#define CAN_TXBCIE_CFIE23_Pos                 _U_(23)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 23 Position */
#define CAN_TXBCIE_CFIE23_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE23_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 23 Mask */
#define CAN_TXBCIE_CFIE23(value)              (CAN_TXBCIE_CFIE23_Msk & ((value) << CAN_TXBCIE_CFIE23_Pos))
#define CAN_TXBCIE_CFIE24_Pos                 _U_(24)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 24 Position */
#define CAN_TXBCIE_CFIE24_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE24_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 24 Mask */
#define CAN_TXBCIE_CFIE24(value)              (CAN_TXBCIE_CFIE24_Msk & ((value) << CAN_TXBCIE_CFIE24_Pos))
#define CAN_TXBCIE_CFIE25_Pos                 _U_(25)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 25 Position */
#define CAN_TXBCIE_CFIE25_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE25_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 25 Mask */
#define CAN_TXBCIE_CFIE25(value)              (CAN_TXBCIE_CFIE25_Msk & ((value) << CAN_TXBCIE_CFIE25_Pos))
#define CAN_TXBCIE_CFIE26_Pos                 _U_(26)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 26 Position */
#define CAN_TXBCIE_CFIE26_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE26_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 26 Mask */
#define CAN_TXBCIE_CFIE26(value)              (CAN_TXBCIE_CFIE26_Msk & ((value) << CAN_TXBCIE_CFIE26_Pos))
#define CAN_TXBCIE_CFIE27_Pos                 _U_(27)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 27 Position */
#define CAN_TXBCIE_CFIE27_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE27_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 27 Mask */
#define CAN_TXBCIE_CFIE27(value)              (CAN_TXBCIE_CFIE27_Msk & ((value) << CAN_TXBCIE_CFIE27_Pos))
#define CAN_TXBCIE_CFIE28_Pos                 _U_(28)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 28 Position */
#define CAN_TXBCIE_CFIE28_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE28_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 28 Mask */
#define CAN_TXBCIE_CFIE28(value)              (CAN_TXBCIE_CFIE28_Msk & ((value) << CAN_TXBCIE_CFIE28_Pos))
#define CAN_TXBCIE_CFIE29_Pos                 _U_(29)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 29 Position */
#define CAN_TXBCIE_CFIE29_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE29_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 29 Mask */
#define CAN_TXBCIE_CFIE29(value)              (CAN_TXBCIE_CFIE29_Msk & ((value) << CAN_TXBCIE_CFIE29_Pos))
#define CAN_TXBCIE_CFIE30_Pos                 _U_(30)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 30 Position */
#define CAN_TXBCIE_CFIE30_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE30_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 30 Mask */
#define CAN_TXBCIE_CFIE30(value)              (CAN_TXBCIE_CFIE30_Msk & ((value) << CAN_TXBCIE_CFIE30_Pos))
#define CAN_TXBCIE_CFIE31_Pos                 _U_(31)                                              /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 31 Position */
#define CAN_TXBCIE_CFIE31_Msk                 (_U_(0x1) << CAN_TXBCIE_CFIE31_Pos)                  /**< (CAN_TXBCIE) Cancellation Finished Interrupt Enable 31 Mask */
#define CAN_TXBCIE_CFIE31(value)              (CAN_TXBCIE_CFIE31_Msk & ((value) << CAN_TXBCIE_CFIE31_Pos))
#define CAN_TXBCIE_Msk                        _U_(0xFFFFFFFF)                                      /**< (CAN_TXBCIE) Register Mask  */

#define CAN_TXBCIE_CFIE_Pos                   _U_(0)                                               /**< (CAN_TXBCIE Position) Cancellation Finished Interrupt Enable 3x */
#define CAN_TXBCIE_CFIE_Msk                   (_U_(0xFFFFFFFF) << CAN_TXBCIE_CFIE_Pos)             /**< (CAN_TXBCIE Mask) CFIE */
#define CAN_TXBCIE_CFIE(value)                (CAN_TXBCIE_CFIE_Msk & ((value) << CAN_TXBCIE_CFIE_Pos)) 

